#+STARTUP: showall indent

* GPU Driver
** GPU の確認

#+begin_src sh :results list
lspci | grep VGA
#+end_src

#+RESULTS:
- ("00:02.0" "VGA" "compatible" "controller:" "Intel" "Corporation" "HD" "Graphics" 530 "(rev" "06)" "" "" "")
- ("01:00.0" "VGA" "compatible" "controller:" "Advanced" "Micro" "Devices," "Inc." "[AMD/ATI]" "Barts" "PRO" "[Radeon" "HD" "6850]")
- ("04:00.0" "VGA" "compatible" "controller:" "NVIDIA" "Corporation" "GK208B" "[GeForce" "GT" "730]" "(rev" "a1)" "" "")
  
** NVIDIA GPU

- リポジトリ
sudo add-apt-repository ppa:graphics-drivers/ppa

- 推奨ドライバの確認 -> "recommended" をインストールする
#+begin_src sh :results list
ubuntu-drivers devices
#+end_src

#+RESULTS:
- ("==" "/sys/devices/pci0000:00/0000:00:1c.4/0000:04:00.0" "==" "" "" "" "")
- ("modalias" ":" "pci:v000010DEd00001287sv00000000sd00000000bc03sc00i00" "" "" "" "")
- ("vendor" ":" "NVIDIA" "Corporation" "" "" "")
- ("model" ":" "GK208B" "[GeForce" "GT" "730]" "")
- ("driver" ":" "nvidia-driver-430" 0 "third-party" "free" "recommended")
- ("driver" ":" "nvidia-driver-410" 0 "third-party" "free" "")
- ("driver" ":" "nvidia-340" 0 "distro" "non-free" "")
- ("driver" ":" "nvidia-driver-396" 0 "third-party" "free" "")
- ("driver" ":" "nvidia-driver-390" 0 "distro" "non-free" "")
- ("driver" ":" "nvidia-driver-415" 0 "third-party" "free" "")
- ("driver" ":" "nvidia-driver-418" 0 "third-party" "free" "")
- ("driver" ":" "xserver-xorg-video-nouveau" 0 "distro" "free" "builtin")

- Install
sudo apt install nvidia-driver-430

- 確認
nvidia-smi

* ディスプレイスケーリング

- 100/200/300% のみしか選択できない (125%,150%等を選びたい)
  - [[https://askubuntu.com/questions/1029436/enable-fractional-scaling-for-ubuntu-18-04][Enable fractional scaling for Ubuntu 18.04@StackExchange]]

- 19.04 (Gnome 3.32) からは設定で有効化できる模様
  - [[https://www.omgubuntu.co.uk/2019/06/enable-fractional-scaling-ubuntu-19-04][How to Enable Fractional Scaling in Ubuntu 19.04]]

- 18.10 での例
  - [[https://techienotes.blog/2019/01/10/set-fractional-display-scaling-on-ubuntu-18-10-xorg/][Set fractional display scaling on Ubuntu 18.10 (XORG)]]

* 2 つのディスプレイを 1 つとして扱う

- [[https://bbs.archlinux.org/viewtopic.php?id=214841][Treat two monitors as one?]]
- [[https://unix.stackexchange.com/questions/378373/add-virtual-output-to-xorg][Add VIRTUAL output to Xorg]]

#+begin_src shell
cvt 3840 2160
xrandr --newmode "3840x2160_60.00"  712.75  3840 4160 4576 5312  2160 2163 2168 2237 -hsync +vsync
xrandr --addmode VIRTUAL1 3840x2160_60.00
xrandr --output HDMI1 --same-as VIRTUAL1
xrandr --output HDMI2 --right-of HDMI1
#+end_src
